## Задание 1

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_name':['Тургенев', 'Чехов', 'Островский'],
                   'author_id':[1, 2, 3]}, columns=['author_name','author_id'])
authors

  author_name  author_id
0    Тургенев          1
1       Чехов          2
2  Островский          3

In [4]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])

In [5]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [7]:
book.shape

(7, 3)

In [10]:
book.describe()

       author_id       price
count   7.000000    7.000000
mean    1.857143  387.142857
std     0.899735   80.976187
min     1.000000  290.000000
25%     1.000000  325.000000
50%     2.000000  370.000000
75%     2.500000  450.000000
max     3.000000  500.000000

## Задание 2

In [12]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

  author_name  author_id            book_title  price
0    Тургенев          1           Отцы и дети    450
1    Тургенев          1                 Рудин    300
2    Тургенев          1     Дворянское гнездо    350
3       Чехов          2      Толстый и тонкий    500
4       Чехов          2       Дама с собачкой    450
5  Островский          3                 Гроза    370
6  Островский          3  Таланты и поклонники    290

## Задание 3

In [16]:
top5 = authors_price.nlargest(5, 'price')
top5

  author_name  author_id         book_title  price
3       Чехов          2   Толстый и тонкий    500
0    Тургенев          1        Отцы и дети    450
4       Чехов          2    Дама с собачкой    450
5  Островский          3              Гроза    370
2    Тургенев          1  Дворянское гнездо    350

## Задание 4

In [17]:
authors_stat = authors_price.groupby('author_name').agg({'price': ['min', 'max', 'mean']})
authors_stat.columns = ['min_price', 'max_price', 'mean_price']
authors_stat.reset_index(inplace=True)
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000